I merged this with main and modified the tests. The tests are less comprehensive than your original but will work with replay. I also tested this with a universal access permission group on a local instance (see the terraform output below) and this seems to be working well. I'm going to accept, but @Keshavrajsinghal can you also review the changes I made prior to merging?

```
❯ terraform apply
retool_group.admin_group: Preparing import... [id=5]
retool_group.admin_group: Refreshing state... [id=5]

Terraform used the selected providers to generate the following
execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # retool_folder.example_app_folder will be created
  + resource "retool_folder" "example_app_folder" {
      + folder_type      = "app"
      + id               = (known after apply)
      + is_system_folder = (known after apply)
      + legacy_id        = (known after apply)
      + name             = "Terraform Example App Folder 2"
      + parent_folder_id = "ROOT"
    }

  # retool_group.admin_group will be imported
    resource "retool_group" "admin_group" {
        account_details_access         = false
        audit_log_access               = false
        id                             = "5"
        legacy_id                      = "5"
        name                           = "app_admin_group"
        theme_access                   = false
        universal_app_access           = "own"
        universal_query_library_access = "none"
        universal_resource_access      = "none"
        universal_workflow_access      = "none"
        unpublished_release_access     = false
        usage_analytics_access         = false
        user_list_access               = false
    }

  # retool_group.test_group will be created
  + resource "retool_group" "test_group" {
      + account_details_access         = true
      + audit_log_access               = true
      + id                             = (known after apply)
      + legacy_id                      = (known after apply)
      + name                           = "Test Group"
      + theme_access                   = false
      + universal_app_access           = "use"
      + universal_query_library_access = "none"
      + universal_resource_access      = "none"
      + universal_workflow_access      = "none"
      + unpublished_release_access     = false
      + usage_analytics_access         = true
      + user_list_access               = false
    }

  # retool_permissions.test_permissions will be created
  + resource "retool_permissions" "test_permissions" {
      + permissions = [
          + {
              + access_level = "own"
              + object       = {
                  + id   = (known after apply)
                  + type = "folder"
                }
            },
        ]
      + subject     = {
          + id   = (known after apply)
          + type = "group"
        }
    }

Plan: 1 to import, 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

retool_group.admin_group: Importing... [id=5]
retool_group.admin_group: Import complete [id=5]
retool_folder.example_app_folder: Creating...
retool_group.test_group: Creating...
retool_group.test_group: Creation complete after 1s [id=134]
retool_folder.example_app_folder: Creation complete after 1s [id=app_193]
retool_permissions.test_permissions: Creating...
retool_permissions.test_permissions: Creation complete after 0s

Apply complete! Resources: 1 imported, 3 added, 0 changed, 0 destroyed.
❯ terraform plan
retool_folder.example_app_folder: Refreshing state... [id=app_193]
retool_group.admin_group: Refreshing state... [id=5]
retool_group.test_group: Refreshing state... [id=134]
retool_permissions.test_permissions: Refreshing state...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your
configuration and found no differences, so no changes are needed.
❯
```